УТ_для_edt/src/Catalogs/CRM_СостоянияИнтересов/CRM_СостоянияИнтересов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_СостоянияИнтересов</name>
  <comment>Сценарии продаж</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ВероятностьСделки</name>
    <comment>Вероятность сделки</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДела</name>
    <type>
      <types>CatalogRef.CRM_ВидыДелВзаимодействий</types>
    </type>
  </attributes>
  <attributes>
    <name>Завершено</name>
    <comment>Состояние завершения интереса</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_УказаниеОжидаемойВыручки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСостояния</name>
    <type>
      <types>EnumRef.CRM_ВидыСостоянияИнтереса</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Офис</name>
    <type>
      <types>CatalogRef.CRM_ОфисыКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_ОбязательноеЗаполнениеКлиента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеПланированиеАктивности</name>
    <type>
      <types>EnumRef.CRM_ПланируемыеТипыАктивности</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтерактивноеПланированиеАктивностей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершатьЗапланированныеАктивности</name>
    <type>
      <types>EnumRef.CRM_ЗавершаемыеТипыАктивности</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтборЗавершаемыхАктивностей</name>
    <type>
      <types>EnumRef.CRM_ОтборыЗавершаемыхАктивностей</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьДостигнутыйРезультат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДобавитьВероятностьВПредставлениеСостояния</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПредопределенногоЭлемента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИндексЦвета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеСоздаватьЗадачу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПоддержка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияСостояния</name>
    <type>
      <types>EnumRef.CRM_КатегорииСостоянийПоддержки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяемыеРеквизитыИнтереса</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяемыеРеквизитыИнтересаПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьРолевуюАдресацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БлокируемыеРеквизитыИнтереса</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>БлокируемыеРеквизитыИнтересаПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОжидаемыйСрокНаЭтапе</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартОписаниеЭтапа</name>
    <comment>//++ #1656 смарт: Фролов 27.02.2023 //Создание механизма отображения необходимых действий менеджером, на каждом этапе обработки Интереса.</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>смартЧасовНаКвалификацию</name>
    <comment>//++ #Б-1184 Фролов //Добавить реквизиты в справочник &quot;CRM_СостоянияИнтересов&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартЧасовНаВыставлениеКП</name>
    <comment>//++ #Б-1184 Фролов //Добавить реквизиты в справочник &quot;CRM_СостоянияИнтересов&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартЧасовНаСогласованиеКП</name>
    <comment>//++ #Б-1184 Фролов //Добавить реквизиты в справочник &quot;CRM_СостоянияИнтересов&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартЧасовНаВыставлениеСчета</name>
    <comment>//++ #Б-1184 Фролов //Добавить реквизиты в справочник &quot;CRM_СостоянияИнтересов&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартЧасовНаОплату</name>
    <comment>//++ #Б-1184 Фролов //Добавить реквизиты в справочник &quot;CRM_СостоянияИнтересов&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТипыУслуг</name>
    <attributes>
      <name>ТипУслуги</name>
      <type>
        <types>CatalogRef.CRM_ТипУслуги</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Подразделения</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТипыОбращений</name>
    <attributes>
      <name>ТипОбращения</name>
      <type>
        <types>CatalogRef.CRM_ТипыОбращений</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>смартТипыУслуг</name>
    <attributes>
      <name>ТипУслуги</name>
      <type>
        <types>CatalogRef.CRM_ТипУслуги</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Enums/CRM_ВидыСостоянияИнтереса/CRM_ВидыСостоянияИнтереса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_ВидыСостоянияИнтереса</name>
  <enumValues>
    <name>Первое</name>
  </enumValues>
  <enumValues>
    <name>УспешноеЗавершение</name>
  </enumValues>
  <enumValues>
    <name>НеудачноеЗавершение</name>
  </enumValues>
  <enumValues>
    <name>смартКвалификация</name>
    <comment>//++ #1698 смарт: Фролов 27.03.2024 //Оповещение Маркетинга и Коммерции о результатах обработки интереса менеджером.</comment>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/CRM_ПланируемыеТипыАктивности/CRM_ПланируемыеТипыАктивности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_ПланируемыеТипыАктивности</name>
  <enumValues>
    <name>Взаимодействие</name>
  </enumValues>
  <enumValues>
    <name>Задача</name>
    <comment>АПК:1208 имя корректное</comment>
  </enumValues>
  <enumValues>
    <name>ВзаимодействиеИЗадача</name>
  </enumValues>
  <enumValues>
    <name>ВзаимодействиеИлиЗадача</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/CRM_ЗавершаемыеТипыАктивности/CRM_ЗавершаемыеТипыАктивности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_ЗавершаемыеТипыАктивности</name>
  <enumValues>
    <name>Взаимодействия</name>
  </enumValues>
  <enumValues>
    <name>Задачи</name>
    <comment>АПК:1208 имя корректное</comment>
  </enumValues>
  <enumValues>
    <name>ВзаимодействияИЗадачи</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/CRM_ОтборыЗавершаемыхАктивностей/CRM_ОтборыЗавершаемыхАктивностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_ОтборыЗавершаемыхАктивностей</name>
  <enumValues>
    <name>ВсеЗапланированные</name>
  </enumValues>
  <enumValues>
    <name>ПерваяЗапланированная</name>
  </enumValues>
  <enumValues>
    <name>ПросроченныеИНаСегодня</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/CRM_КатегорииСостоянийПоддержки/CRM_КатегорииСостоянийПоддержки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_КатегорииСостоянийПоддержки</name>
  <enumValues>
    <name>КВыполнению</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>ВОжидании</name>
  </enumValues>
  <enumValues>
    <name>Выполнено</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Catalogs/CRM_ВоронкиПродаж/CRM_ВоронкиПродаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_ВоронкиПродаж</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>Интересы</name>
      <description>Продажа</description>
    </items>
  </predefined>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Оценка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидЭтапа</name>
    <type>
      <types>EnumRef.CRM_ВидыЭтаповВоронкиПродаж</types>
    </type>
  </attributes>
  <attributes>
    <name>СценарийИнтереса</name>
    <type>
      <types>CatalogRef.CRM_СостоянияИнтересов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексЦвета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>КартаМаршрута</name>
      <type>
        <types>CatalogRef.CRM_СостоянияИнтересов</types>
        <types>CatalogRef.CRM_КартыМаршрутов</types>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТочкаМаршрута</name>
      <type>
        <types>CatalogRef.CRM_СостоянияИнтересов</types>
        <types>CatalogRef.CRM_ТочкиМаршрутов</types>
        <types>ChartOfCharacteristicTypesRef.CRM_ВидыОбъектовБизнесПроцессов</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантСчетаНаОплату</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/CRM_ТипыОбращений/CRM_ТипыОбращений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_ТипыОбращений</name>
  <predefined>
    <items>
      <name>Интерес</name>
      <description>Интерес</description>
    </items>
    <items>
      <name>Обращение</name>
      <description>Обращение</description>
    </items>
  </predefined>
  <attributes>
    <name>ИндексКартинки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/CRM_СостоянияИнтересов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Обновление информационной базы.

// Процедура выполняет заполнение предопределенных элементов справочника.
//
// Параметры:
//	Нет.
//
Процедура ЗаполнитьПредопределенныеЭлементы() Экспорт
	
	// Сценарий по умолчанию
	Сценарий = Справочники.CRM_СостоянияИнтересов.СоздатьЭлемент();
	Сценарий.Наименование = НСтр("ru='Продажа';en='Sale'");
	Сценарий.ВидДела = Справочники.CRM_ВидыДелВзаимодействий.Документ_CRM_Интерес;
	Сценарий.ДополнительныеСвойства.Вставить("НеСоздаватьОбязательные", Истина);
	Сценарий.ДополнительныеСвойства.Вставить("НеОбновлятьВоронкуПродаж", Истина);
	Сценарий.ИдентификаторПредопределенногоЭлемента = "445f4824-5aa6-41ca-b0ab-947f8daf7d17";
	Сценарий.Записать();
	
	Воронка = Справочники.CRM_ВоронкиПродаж.Интересы.ПолучитьОбъект();
	Воронка.СценарийИнтереса = Сценарий.Ссылка;
	Воронка.Записать();
	
	// Элемент "ПервичныйИнтерес"
	ЭлементСправочника = Справочники.CRM_СостоянияИнтересов.СоздатьЭлемент();
	ЭлементСправочника.Родитель					= Сценарий.Ссылка;
	ЭлементСправочника.ВидСостояния = Перечисления.CRM_ВидыСостоянияИнтереса.Первое;
	ЭлементСправочника.Наименование = НСтр("ru='Переговоры';en='Negotiations'");
	ЭлементСправочника.ВероятностьСделки			= 10;
	ЭлементСправочника.ВидДела						= Справочники.CRM_ВидыДелВзаимодействий.Документ_CRM_Интерес;
	ЭлементСправочника.Завершено					= Ложь;
	ЭлементСправочника.Используется					= Истина;
	ЭлементСправочника.ОбязательноеПланированиеАктивности = Перечисления.CRM_ПланируемыеТипыАктивности.ВзаимодействиеИлиЗадача;
	ЭлементСправочника.ИдентификаторПредопределенногоЭлемента = "95829933-6e17-4f3d-bcc2-39972430f2e0";
	ЭлементСправочника.ИндексЦвета = 16;
	ЭлементСправочника.Записать();
	
	// Элемент "Предложение"
	ЭлементСправочника = Справочники.CRM_СостоянияИнтересов.СоздатьЭлемент();
	ЭлементСправочника.Родитель					= Сценарий.Ссылка;
	ЭлементСправочника.Наименование = НСтр("ru='Счет';en='Account'");
	ЭлементСправочника.ВероятностьСделки			= 60;
	ЭлементСправочника.ВидДела						= Справочники.CRM_ВидыДелВзаимодействий.Документ_CRM_Интерес;
	ЭлементСправочника.Завершено					= Ложь;
	ЭлементСправочника.Используется					= Истина;
	ЭлементСправочника.ОбязательноеПланированиеАктивности = Перечисления.CRM_ПланируемыеТипыАктивности.ВзаимодействиеИлиЗадача;
	ЭлементСправочника.ИдентификаторПредопределенногоЭлемента = "6965b336-b89d-4a4a-81eb-9db37d0dd087";
	ЭлементСправочника.ИндексЦвета = 22;
	ПроверяемыеРеквизиты = Новый Массив;
	ПроверяемыеРеквизиты.Добавить("Партнер");
	ЭлементСправочника.ПроверяемыеРеквизитыИнтереса = Новый ХранилищеЗначения(ПроверяемыеРеквизиты);
	ЭлементСправочника.Записать();
	
	// Элемент "ВыполнениеДоговора"
	ЭлементСправочника = Справочники.CRM_СостоянияИнтересов.СоздатьЭлемент();
	ЭлементСправочника.Родитель					= Сценарий.Ссылка;
	ЭлементСправочника.Наименование = НСтр("ru='Отгрузка';en='Shipment'");
	ЭлементСправочника.ВероятностьСделки			= 100;
	ЭлементСправочника.ВидДела						= Справочники.CRM_ВидыДелВзаимодействий.Документ_CRM_Интерес;
	ЭлементСправочника.Завершено					= Ложь;
	ЭлементСправочника.Используется					= Истина;
	ЭлементСправочника.ОбязательноеПланированиеАктивности = Перечисления.CRM_ПланируемыеТипыАктивности.ВзаимодействиеИлиЗадача;
	ЭлементСправочника.ИдентификаторПредопределенногоЭлемента = "b1bdc813-af6d-4103-86a2-77d73c84eae3";
	ЭлементСправочника.ИндексЦвета = 4;
	ПроверяемыеРеквизиты = Новый Массив;
	ПроверяемыеРеквизиты.Добавить("Партнер");
	ЭлементСправочника.ПроверяемыеРеквизитыИнтереса = Новый ХранилищеЗначения(ПроверяемыеРеквизиты);
	ЭлементСправочника.Записать();
	
	// Элемент "ИнтересЗакрыт"
	ЭлементСправочника = Справочники.CRM_СостоянияИнтересов.СоздатьЭлемент();
	ЭлементСправочника.Родитель					= Сценарий.Ссылка;
	ЭлементСправочника.ВидСостояния = Перечисления.CRM_ВидыСостоянияИнтереса.УспешноеЗавершение;
	ЭлементСправочника.Наименование = НСтр("ru='Завершен успешно';en='Finished successfully'");
	ЭлементСправочника.ВероятностьСделки			= 100;
	ЭлементСправочника.ВидДела						= Справочники.CRM_ВидыДелВзаимодействий.Документ_CRM_Интерес;
	ЭлементСправочника.Завершено					= Истина;
	ЭлементСправочника.Используется					= Истина;
	ЭлементСправочника.ЗавершатьЗапланированныеАктивности = Перечисления.CRM_ЗавершаемыеТипыАктивности.ВзаимодействияИЗадачи;
	ЭлементСправочника.ОтборЗавершаемыхАктивностей = Перечисления.CRM_ОтборыЗавершаемыхАктивностей.ВсеЗапланированные;
	ЭлементСправочника.РеквизитДопУпорядочивания	= 98;
	ЭлементСправочника.ДополнительныеСвойства.Вставить("РеквизитаУпорядочиванияУстановлен", Истина);
	ЭлементСправочника.ИдентификаторПредопределенногоЭлемента = "e9477c0f-e2f9-476b-8c82-122c95f87514";
	ЭлементСправочника.ИндексЦвета = 19;
	ПроверяемыеРеквизиты = Новый Массив;
	ПроверяемыеРеквизиты.Добавить("Партнер");
	ЭлементСправочника.ПроверяемыеРеквизитыИнтереса = Новый ХранилищеЗначения(ПроверяемыеРеквизиты);
	ЭлементСправочника.Записать();
	
	// Элемент "ИнтересПотерян"
	ЭлементСправочника = Справочники.CRM_СостоянияИнтересов.СоздатьЭлемент();
	ЭлементСправочника.Родитель					= Сценарий.Ссылка;
	ЭлементСправочника.ВидСостояния = Перечисления.CRM_ВидыСостоянияИнтереса.НеудачноеЗавершение;
	ЭлементСправочника.Наименование = НСтр("ru='Завершен неудачно';en='Unsuccessful'");
	ЭлементСправочника.ВероятностьСделки			= 0;
	ЭлементСправочника.ВидДела						= Справочники.CRM_ВидыДелВзаимодействий.Документ_CRM_Интерес;
	ЭлементСправочника.Завершено					= Истина;
	ЭлементСправочника.Используется					= Истина;
	ЭлементСправочника.ЗавершатьЗапланированныеАктивности = Перечисления.CRM_ЗавершаемыеТипыАктивности.ВзаимодействияИЗадачи;
	ЭлементСправочника.ОтборЗавершаемыхАктивностей = Перечисления.CRM_ОтборыЗавершаемыхАктивностей.ВсеЗапланированные;
	ЭлементСправочника.РеквизитДопУпорядочивания	= 99;
	ЭлементСправочника.ДополнительныеСвойства.Вставить("РеквизитаУпорядочиванияУстановлен", Истина);
	ЭлементСправочника.ИдентификаторПредопределенногоЭлемента = "48f2b1da-3a47-4602-961e-d1aef3701d95";
	ЭлементСправочника.ИндексЦвета = 15;
	ЭлементСправочника.Записать();
	
	СоздатьСценарийПоддержкиПоУмолчанию(Новый Структура("ОбработкаЗавершена", Ложь));
	
КонецПроцедуры // ЗаполнитьПредопределенныеЭлементы()

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Данные.ДобавитьВероятностьВПредставлениеСостояния = Истина И ЗначениеЗаполнено(Данные.ВероятностьСделки) Тогда
		Представление = Данные.Наименование + " (" + Данные.ВероятностьСделки + "%)";
	Иначе
		Представление = Данные.Наименование;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Наименование");
	Поля.Добавить("ВероятностьСделки");
	Поля.Добавить("ДобавитьВероятностьВПредставлениеСостояния");

КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	Если ВидФормы = "ФормаОбъекта" И Параметры.Свойство("Ключ") Тогда
		СтандартнаяОбработка = Ложь;
		Если НЕ ЗначениеЗаполнено(Параметры.Ключ.Родитель) Тогда
			ВыбраннаяФорма = "Справочник.CRM_СостоянияИнтересов.Форма.ФормаЭлементаСценария";
		Иначе
			ВыбраннаяФорма = "Справочник.CRM_СостоянияИнтересов.Форма.ФормаЭлемента";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура СоздатьОбязательныеСостоянияСценария(Сценарий, ЭтоПоддержка = Ложь) Экспорт
	
	Если ЭтоПоддержка Тогда
		СоздатьОбязательныеСостоянияСценарияПоддержки(Сценарий);
	Иначе
		СоздатьОбязательныеСостоянияСценарияПродажи(Сценарий);
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьОбязательныеСостоянияСценарияПродажи(Сценарий)
	
	НовыйЭлемент = Справочники.CRM_СостоянияИнтересов.СоздатьЭлемент();
	НовыйЭлемент.Родитель = Сценарий;
	НовыйЭлемент.Наименование = НСтр("ru='Переговоры';en='Negotiations'");
	НовыйЭлемент.ВидДела = Справочники.CRM_ВидыДелВзаимодействий.Документ_CRM_Интерес;
	НовыйЭлемент.Завершено = Ложь;
	НовыйЭлемент.РеквизитДопУпорядочивания = 1;
	НовыйЭлемент.ВидСостояния = Перечисления.CRM_ВидыСостоянияИнтереса.Первое;
	НовыйЭлемент.Используется = Истина;
	НовыйЭлемент.ОбязательноеПланированиеАктивности = Перечисления.CRM_ПланируемыеТипыАктивности.ВзаимодействиеИлиЗадача;
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = Справочники.CRM_СостоянияИнтересов.СоздатьЭлемент();
	НовыйЭлемент.Родитель = Сценарий;
	НовыйЭлемент.Наименование = НСтр("ru='Завершен успешно';en='Finished successfully'");
	НовыйЭлемент.ВидДела = Справочники.CRM_ВидыДелВзаимодействий.Документ_CRM_Интерес;
	НовыйЭлемент.Завершено = Истина;
	НовыйЭлемент.РеквизитДопУпорядочивания = 98;
	НовыйЭлемент.ВидСостояния = Перечисления.CRM_ВидыСостоянияИнтереса.УспешноеЗавершение;
	НовыйЭлемент.Используется = Истина;
	НовыйЭлемент.ВероятностьСделки = 100;
	НовыйЭлемент.ЗавершатьЗапланированныеАктивности = Перечисления.CRM_ЗавершаемыеТипыАктивности.ВзаимодействияИЗадачи;
	НовыйЭлемент.ОтборЗавершаемыхАктивностей = Перечисления.CRM_ОтборыЗавершаемыхАктивностей.ВсеЗапланированные;
	НовыйЭлемент.ДополнительныеСвойства.Вставить("РеквизитаУпорядочиванияУстановлен", Истина);
	ПроверяемыеРеквизиты = Новый Массив;
	ПроверяемыеРеквизиты.Добавить("ОжидаемаяВыручка");
	ПроверяемыеРеквизиты.Добавить("Партнер");
	НовыйЭлемент.ПроверяемыеРеквизитыИнтереса = Новый ХранилищеЗначения(ПроверяемыеРеквизиты);
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = Справочники.CRM_СостоянияИнтересов.СоздатьЭлемент();
	НовыйЭлемент.Родитель = Сценарий;
	НовыйЭлемент.Наименование = НСтр("ru='Завершен неудачно';en='Unsuccessful'");
	НовыйЭлемент.ВидДела = Справочники.CRM_ВидыДелВзаимодействий.Документ_CRM_Интерес;
	НовыйЭлемент.Завершено = Истина;
	НовыйЭлемент.РеквизитДопУпорядочивания = 99;
	НовыйЭлемент.ВидСостояния = Перечисления.CRM_ВидыСостоянияИнтереса.НеудачноеЗавершение;
	НовыйЭлемент.Используется = Истина;
	НовыйЭлемент.ВероятностьСделки = 0;
	НовыйЭлемент.ЗавершатьЗапланированныеАктивности = Перечисления.CRM_ЗавершаемыеТипыАктивности.ВзаимодействияИЗадачи;
	НовыйЭлемент.ОтборЗавершаемыхАктивностей = Перечисления.CRM_ОтборыЗавершаемыхАктивностей.ВсеЗапланированные;
	НовыйЭлемент.ДополнительныеСвойства.Вставить("РеквизитаУпорядочиванияУстановлен", Истина);
	НовыйЭлемент.Записать();
	
КонецПроцедуры

Процедура СоздатьОбязательныеСостоянияСценарияПоддержки(Сценарий)
	
	НовыйЭлемент = Справочники.CRM_СостоянияИнтересов.СоздатьЭлемент();
	НовыйЭлемент.Родитель = Сценарий;
	НовыйЭлемент.Наименование = НСтр("ru='Зарегистрировано'");
	НовыйЭлемент.ВидДела = Справочники.CRM_ВидыДелВзаимодействий.Документ_CRM_Интерес;
	НовыйЭлемент.Завершено = Ложь;
	НовыйЭлемент.РеквизитДопУпорядочивания = 1;
	НовыйЭлемент.ВидСостояния = Перечисления.CRM_ВидыСостоянияИнтереса.Первое;
	НовыйЭлемент.Используется = Истина;
	НовыйЭлемент.КатегорияСостояния = Перечисления.CRM_КатегорииСостоянийПоддержки.КВыполнению;
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = Справочники.CRM_СостоянияИнтересов.СоздатьЭлемент();
	НовыйЭлемент.Родитель = Сценарий;
	НовыйЭлемент.Наименование = НСтр("ru='В работе'");
	НовыйЭлемент.ВидДела = Справочники.CRM_ВидыДелВзаимодействий.Документ_CRM_Интерес;
	НовыйЭлемент.Завершено = Ложь;
	НовыйЭлемент.РеквизитДопУпорядочивания = 2;
	НовыйЭлемент.Используется = Истина;
	НовыйЭлемент.КатегорияСостояния = Перечисления.CRM_КатегорииСостоянийПоддержки.ВРаботе;
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = Справочники.CRM_СостоянияИнтересов.СоздатьЭлемент();
	НовыйЭлемент.Родитель = Сценарий;
	НовыйЭлемент.Наименование = НСтр("ru='В ожидании'");
	НовыйЭлемент.ВидДела = Справочники.CRM_ВидыДелВзаимодействий.Документ_CRM_Интерес;
	НовыйЭлемент.Завершено = Ложь;
	НовыйЭлемент.РеквизитДопУпорядочивания = 3;
	НовыйЭлемент.Используется = Истина;
	НовыйЭлемент.КатегорияСостояния = Перечисления.CRM_КатегорииСостоянийПоддержки.ВОжидании;
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = Справочники.CRM_СостоянияИнтересов.СоздатьЭлемент();
	НовыйЭлемент.Родитель = Сценарий;
	НовыйЭлемент.Наименование = НСтр("ru = 'Выполнено'");
	НовыйЭлемент.ВидДела = Справочники.CRM_ВидыДелВзаимодействий.Документ_CRM_Интерес;
	НовыйЭлемент.Завершено = Истина;
	НовыйЭлемент.РеквизитДопУпорядочивания = 99;
	НовыйЭлемент.ВидСостояния = Перечисления.CRM_ВидыСостоянияИнтереса.УспешноеЗавершение;
	НовыйЭлемент.Используется = Истина;
	НовыйЭлемент.КатегорияСостояния = Перечисления.CRM_КатегорииСостоянийПоддержки.Выполнено;
	НовыйЭлемент.ЗавершатьЗапланированныеАктивности = Перечисления.CRM_ЗавершаемыеТипыАктивности.ВзаимодействияИЗадачи;
	НовыйЭлемент.ОтборЗавершаемыхАктивностей = Перечисления.CRM_ОтборыЗавершаемыхАктивностей.ВсеЗапланированные;
	НовыйЭлемент.ДополнительныеСвойства.Вставить("РеквизитаУпорядочиванияУстановлен", Истина);
	ПроверяемыеРеквизиты = Новый Массив;
	ПроверяемыеРеквизиты.Добавить("Партнер");
	НовыйЭлемент.ПроверяемыеРеквизитыИнтереса = Новый ХранилищеЗначения(ПроверяемыеРеквизиты);
	НовыйЭлемент.Записать();
	
КонецПроцедуры

#Область ПереходНаНовуюВерсию

Процедура СоздатьСценарийПоддержкиПоУмолчанию(Параметры) Экспорт
	
	ОбработкаЗавершена = Истина;
	
	Попытка
	
		НаименованиеСценарияПоддержки = НСтр("ru = 'Поддержка'");
		РезультатПоискаСценария = Справочники.CRM_СостоянияИнтересов.НайтиПоНаименованию(НаименованиеСценарияПоддержки, Истина, Справочники.CRM_СостоянияИнтересов.ПустаяСсылка());
		Если НЕ ЗначениеЗаполнено(РезультатПоискаСценария) Тогда
		
			СценарийОб = Справочники.CRM_СостоянияИнтересов.СоздатьЭлемент();
			СценарийОб.Наименование = НаименованиеСценарияПоддержки;
			СценарийОб.ЭтоПоддержка = Истина;
			СценарийОб.ДополнительныеСвойства.Вставить("НеСоздаватьОбязательные", Истина);
			СценарийОб.ВидДела = Справочники.CRM_ВидыДелВзаимодействий.Документ_CRM_Интерес;
			НС_ТипыОбращений = СценарийОб.ТипыОбращений.Добавить();
			НС_ТипыОбращений.ТипОбращения = Справочники.CRM_ТипыОбращений.Обращение;
			СценарийОб.Записать();
			Сценарий = СценарийОб.Ссылка;
			
			НовыйЭлемент = Справочники.CRM_СостоянияИнтересов.СоздатьЭлемент();
			НовыйЭлемент.Родитель = Сценарий;
			НовыйЭлемент.Наименование = НСтр("ru='К выполнению'");
			НовыйЭлемент.ВидДела = Справочники.CRM_ВидыДелВзаимодействий.Документ_CRM_Интерес;
			НовыйЭлемент.Завершено = Ложь;
			НовыйЭлемент.РеквизитДопУпорядочивания = 1;
			НовыйЭлемент.ВидСостояния = Перечисления.CRM_ВидыСостоянияИнтереса.Первое;
			НовыйЭлемент.Используется = Истина;
			НовыйЭлемент.КатегорияСостояния = Перечисления.CRM_КатегорииСостоянийПоддержки.КВыполнению;
			НовыйЭлемент.ИндексЦвета = 16; // темно-оранжевый
			НовыйЭлемент.Записать();
			
			НовыйЭлемент = Справочники.CRM_СостоянияИнтересов.СоздатьЭлемент();
			НовыйЭлемент.Родитель = Сценарий;
			НовыйЭлемент.Наименование = НСтр("ru='В работе'");
			НовыйЭлемент.ВидДела = Справочники.CRM_ВидыДелВзаимодействий.Документ_CRM_Интерес;
			НовыйЭлемент.Завершено = Ложь;
			НовыйЭлемент.РеквизитДопУпорядочивания = 2;
			НовыйЭлемент.Используется = Истина;
			НовыйЭлемент.КатегорияСостояния = Перечисления.CRM_КатегорииСостоянийПоддержки.ВРаботе;
			НовыйЭлемент.ИндексЦвета = 22; // темно-синий
			НовыйЭлемент.Записать();
			
			НовыйЭлемент = Справочники.CRM_СостоянияИнтересов.СоздатьЭлемент();
			НовыйЭлемент.Родитель = Сценарий;
			НовыйЭлемент.Наименование = НСтр("ru='В ожидании'");
			НовыйЭлемент.ВидДела = Справочники.CRM_ВидыДелВзаимодействий.Документ_CRM_Интерес;
			НовыйЭлемент.Завершено = Ложь;
			НовыйЭлемент.РеквизитДопУпорядочивания = 3;
			НовыйЭлемент.Используется = Истина;
			НовыйЭлемент.КатегорияСостояния = Перечисления.CRM_КатегорииСостоянийПоддержки.ВОжидании;
			НовыйЭлемент.ИндексЦвета = 4; // зеленый
			НовыйЭлемент.Записать();
			
			НовыйЭлемент = Справочники.CRM_СостоянияИнтересов.СоздатьЭлемент();
			НовыйЭлемент.Родитель = Сценарий;
			НовыйЭлемент.Наименование = НСтр("ru = 'Выполнено'");
			НовыйЭлемент.ВидДела = Справочники.CRM_ВидыДелВзаимодействий.Документ_CRM_Интерес;
			НовыйЭлемент.Завершено = Истина;
			НовыйЭлемент.РеквизитДопУпорядочивания = 99;
			НовыйЭлемент.ВидСостояния = Перечисления.CRM_ВидыСостоянияИнтереса.УспешноеЗавершение;
			НовыйЭлемент.Используется = Истина;
			НовыйЭлемент.КатегорияСостояния = Перечисления.CRM_КатегорииСостоянийПоддержки.Выполнено;
			НовыйЭлемент.ЗавершатьЗапланированныеАктивности = Перечисления.CRM_ЗавершаемыеТипыАктивности.ВзаимодействияИЗадачи;
			НовыйЭлемент.ОтборЗавершаемыхАктивностей = Перечисления.CRM_ОтборыЗавершаемыхАктивностей.ВсеЗапланированные;
			НовыйЭлемент.ДополнительныеСвойства.Вставить("РеквизитаУпорядочиванияУстановлен", Истина);
			НовыйЭлемент.ИндексЦвета = 19; // темно-зеленый
			ПроверяемыеРеквизиты = Новый Массив;
			ПроверяемыеРеквизиты.Добавить("Партнер");
			НовыйЭлемент.ПроверяемыеРеквизитыИнтереса = Новый ХранилищеЗначения(ПроверяемыеРеквизиты);
			НовыйЭлемент.Записать();
			
		КонецЕсли;
	
	Исключение
		
		ОбработкаЗавершена = Ложь;
		
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Не удалось создать сценарий поддержки по причине:""%1';en='Failed to create script due to:""%1'"), 
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));

		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Предупреждение,
				,, ТекстСообщения);
		
	КонецПопытки;
	
	Параметры.ОбработкаЗавершена = ОбработкаЗавершена;
	
КонецПроцедуры

#КонецОбласти

Функция ПервичноеСостояниеСценария(Сценарий) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_СостоянияИнтересов.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.CRM_СостоянияИнтересов КАК CRM_СостоянияИнтересов
	                      |ГДЕ
	                      |	CRM_СостоянияИнтересов.ВидСостояния = &ВидСостояния
	                      |	И CRM_СостоянияИнтересов.Родитель = &Родитель");
	
	Запрос.УстановитьПараметр("Родитель", Сценарий);
	Запрос.УстановитьПараметр("ВидСостояния", Перечисления.CRM_ВидыСостоянияИнтереса.Первое);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе	
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

Функция УспешноеЗавершениеСценария(Сценарий) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_СостоянияИнтересов.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.CRM_СостоянияИнтересов КАК CRM_СостоянияИнтересов
	                      |ГДЕ
	                      |	CRM_СостоянияИнтересов.ВидСостояния = &ВидСостояния
	                      |	И CRM_СостоянияИнтересов.Родитель = &Родитель");
	
	Запрос.УстановитьПараметр("Родитель", Сценарий);
	Запрос.УстановитьПараметр("ВидСостояния", Перечисления.CRM_ВидыСостоянияИнтереса.УспешноеЗавершение);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе	
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

Функция НеудачноеЗавершениеСценария(Сценарий) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_СостоянияИнтересов.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.CRM_СостоянияИнтересов КАК CRM_СостоянияИнтересов
	                      |ГДЕ
	                      |	CRM_СостоянияИнтересов.ВидСостояния = &ВидСостояния
	                      |	И CRM_СостоянияИнтересов.Родитель = &Родитель");
	
	Запрос.УстановитьПараметр("Родитель", Сценарий);
	Запрос.УстановитьПараметр("ВидСостояния", Перечисления.CRM_ВидыСостоянияИнтереса.НеудачноеЗавершение);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе	
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

Функция МассивСостоянийПоСценарию(Сценарий) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_СостоянияИнтересов.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.CRM_СостоянияИнтересов КАК CRM_СостоянияИнтересов
	                      |ГДЕ
	                      |	CRM_СостоянияИнтересов.Родитель = &Родитель");
	Запрос.УстановитьПараметр("Родитель", Сценарий);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
КонецФункции

Процедура УстановитьЦветаСостояниям() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_СостоянияИнтересов.Родитель КАК Родитель,
	                      |	CRM_СостоянияИнтересов.Ссылка КАК Ссылка,
	                      |	CRM_СостоянияИнтересов.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания
	                      |ИЗ
	                      |	Справочник.CRM_СостоянияИнтересов КАК CRM_СостоянияИнтересов
	                      |ГДЕ
	                      |	CRM_СостоянияИнтересов.Родитель <> ЗНАЧЕНИЕ(Справочник.CRM_СостоянияИнтересов.ПустаяСсылка)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	РеквизитДопУпорядочивания
	                      |ИТОГИ ПО
	                      |	Родитель");
	ВыборкаРодитель = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	СписокЦветовПоУмолчанию = CRM_ОбщегоНазначенияКлиентСервер.ПолучитьСписокЦветовПоУмолчанию();
	Пока ВыборкаРодитель.Следующий() Цикл
		Индекс = 0;
		Выборка = ВыборкаРодитель.Выбрать();
		Пока Выборка.Следующий() Цикл
			Состояние = Выборка.Ссылка.ПолучитьОбъект();
			Если Состояние.ВидСостояния = Перечисления.CRM_ВидыСостоянияИнтереса.УспешноеЗавершение Тогда
				Состояние.ИндексЦвета = 19;
			ИначеЕсли Состояние.ВидСостояния = Перечисления.CRM_ВидыСостоянияИнтереса.НеудачноеЗавершение Тогда
				Состояние.ИндексЦвета = 22;
			Иначе
				Если Индекс>7 Тогда
					Состояние.ИндексЦвета = 17;
				Иначе
					Состояние.ИндексЦвета = СписокЦветовПоУмолчанию[Индекс].Значение;
				КонецЕсли;
				Индекс = Индекс + 1;
			КонецЕсли;
			Состояние.Записать();
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
